{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "name": "conv3d_1", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 30, 128, 128, 3], "use_bias": true, "dtype": "float32", "strides": [2, 4, 4], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_size": [7, 7, 7], "bias_constraint": null, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "name": "max_pooling3d_1", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [3, 3, 3]}}, {"class_name": "Conv3D", "config": {"activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "name": "conv3d_2", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_size": [5, 5, 5], "bias_constraint": null, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64}}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "name": "max_pooling3d_2", "padding": "valid", "trainable": true, "strides": [1, 1, 1], "pool_size": [3, 3, 3]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 20}}]}